package lesson5.homework;

public class HomeWork5 {
    //    Создать класс "Сотрудник" с полями: ФИО, должность, email, телефон, зарплата, возраст.
//    Конструктор класса должен заполнять эти поля при создании объекта.
//    Внутри класса «Сотрудник» написать метод, который выводит информацию об объекте в консоль.
//    Создать массив из 5 сотрудников.
//    С помощью цикла вывести информацию только о сотрудниках старше 40 лет.
//* Добавить подсчет созданных сотрудников
//* Добавить геттер isRetired() который возвращает булево значение, является ли сотрудник пенсионером,
// в зависимости от пола и возраста, НЕ ДЕЛАТЬ ТАКОГО ПОЛЯ В КЛАССЕ
    public static void main(String[] args) {

    }
}
